In [19]:
import pandas as pd

In [43]:
df = pd.read_csv("marksUT.csv", sep = ",")
df

        Name  UT  Maths  Science  S.St.  Hindi  Eng
0      Raman   1     22       21     18     20   21
1      Raman   2     21       20     17     22   24
2      Raman   3     14       19     15     24   23
3    Zuhaire   1     20       17     22     24   19
4    Zuhaire   2     23       15     21     25   15
5    Zuhaire   3     22       18     19     23   13
6   Aashravy   1     23       19     20     15   22
7   Aashravy   2     24       22     24     17   21
8   Aashravy   3     12       25     19     21   23
9     Mishti   1     15       22     25     22   22
10    Mishti   2     18       21     25     24   23
11    Mishti   3     17       18     20     25   20

In [44]:
# marksUT= {'Name':['Raman','Raman','Raman','Zuhaire','Zuhaire','Zuhaire', 'Ashravy','Ashravy','Ashravy','Mishti','Mishti','Mishti'],
#  'UT':[1,2,3,1,2,3,1,2,3,1,2,3],
#  'Maths':[22,21,14,20,23,22,23,24,12,15,18,17],
#  'Science':[21,20,19,17,15,18,19,22,25,22,21,18],
#  'S.St':[18,17,15,22,21,19,20,24,19,25,25,20],
#  'Hindi':[20,22,24,24,25,23,15,17,21,22,24,25],
#  'Eng':[21,24,23,19,15,13,22,21,23,22,23,20]
#  }

# df=pd.DataFrame(marksUT)
# print(df)

## Descriptive Statistics

### Calculating Maximum Values

In [45]:
print(df.max())


# OUTPUT: 

# Name/ Subjects    Zuhaire  # Max value in name column (alphabetically)
# Unit Test               3  # Max value in Unit Test
# Maths                  24  # Max value in Maths
# Science                25  # Max value in Science
# S.St.                  25  # Max value in S.St. 
# Hindi                  25  # Max value in Hindi    
# Eng                    24  # Max value in Eng
# dtype: object

Name       Zuhaire
UT               3
Maths           24
Science         25
S.St.           25
Hindi           25
Eng             24
dtype: object

In [46]:
print(df.max(numeric_only = True))

UT          3
Maths      24
Science    25
S.St.      25
Hindi      25
Eng        24
dtype: int64

Maximum marks obtained in each subject in Unit Test 2.

In [47]:
dfUT2 =df[df.UT == 2]

print("\nResult of Unit Test 2: \n\n",dfUT2)

Result of Unit Test 2:

         Name  UT  Maths  Science  S.St.  Hindi  Eng
1      Raman   2     21       20     17     22   24
4    Zuhaire   2     23       15     21     25   15
7   Aashravy   2     24       22     24     17   21
10    Mishti   2     18       21     25     24   23

Maximum Mark obtained in Each Subject in Unit Test 2

In [48]:
dfUT2.max(numeric_only = True)

UT          2
Maths      24
Science    22
S.St.      25
Hindi      25
Eng        24
dtype: int64

By default, the max() method finds the maximum value of each column (which means, axis=0). 
However, to find the maximum value of each row, we have to specify axis = 1 as its argument.

maximum marks for each student in each unit test among all the subjects

In [49]:
df.max(axis=1 ,numeric_only = True)

0     22
1     24
2     24
3     24
4     25
5     23
6     23
7     24
8     25
9     25
10    25
11    25
dtype: int64

### Calculating Minimum Values

In [39]:
df.min()

Name       Ashravy
UT               1
Maths           12
Science         15
S.St            15
Hindi           15
Eng             13
dtype: object

In [41]:
dfMishti = df.loc[df.Name == "Mishti"]
dfMishti

      Name  UT  Maths  Science  S.St  Hindi  Eng
9   Mishti   1     15       22    25     22   22
10  Mishti   2     18       21    25     24   23
11  Mishti   3     17       18    20     25   20

In [42]:
print("\nMinimum Marks obtained by Mishti in each subject across the unit Tests\n\n",dfMishti[["Maths", "Science", "S.St", "Hindi", "Eng"]].min())

Minimum Marks obtained by Mishti in each subject across the unit Tests

 Maths      15
Science    18
S.St       20
Hindi      22
Eng        20
dtype: int64

### Calculating Sum of Values

In [52]:
df.sum()     # df.sum(numeric_only = True)

Name       RamanRamanRamanZuhaireZuhaireZuhaireAashravyAa...
UT                                                        24
Maths                                                    231
Science                                                  237
S.St.                                                    245
Hindi                                                    262
Eng                                                      246
dtype: object

In [54]:
df["Maths"].sum()

231

In [56]:
dfRaman = df[df["Name"] == "Raman"]
dfRaman

    Name  UT  Maths  Science  S.St.  Hindi  Eng
0  Raman   1     22       21     18     20   21
1  Raman   2     21       20     17     22   24
2  Raman   3     14       19     15     24   23

In [60]:
dfRaman[["Maths", "Science", "S.St.", "Hindi", "Eng"]].sum()

Maths      57
Science    60
S.St.      50
Hindi      66
Eng        68
dtype: int64

In [61]:
dfRaman[["Maths", "Science", "S.St.", "Hindi", "Eng"]].sum(axis = 1)

0    102
1    104
2     95
dtype: int64

###  Calculating Number of Values

In [62]:
df.count()

Name       12
UT         12
Maths      12
Science    12
S.St.      12
Hindi      12
Eng        12
dtype: int64

In [63]:
# Write a statement to count the number of values in a row.

df.count(axis=1)

0     7
1     7
2     7
3     7
4     7
5     7
6     7
7     7
8     7
9     7
10    7
11    7
dtype: int64

###  Calculating Mean

In [66]:
df.mean(numeric_only=True)

UT          2.000000
Maths      19.250000
Science    19.750000
S.St.      20.416667
Hindi      21.833333
Eng        20.500000
dtype: float64

In [67]:
df[["Maths", "Science", "S.St.", "Hindi", "Eng"]].mean()

Maths      19.250000
Science    19.750000
S.St.      20.416667
Hindi      21.833333
Eng        20.500000
dtype: float64

In [70]:
dfZuhaire = df.loc[df.Name == "Zuhaire"]
dfZuhaire

      Name  UT  Maths  Science  S.St.  Hindi  Eng
3  Zuhaire   1     20       17     22     24   19
4  Zuhaire   2     23       15     21     25   15
5  Zuhaire   3     22       18     19     23   13

In [71]:
dfZuhaireMarks = dfZuhaire.loc[ : ,"Maths": "Eng"]
dfZuhaireMarks

   Maths  Science  S.St.  Hindi  Eng
3     20       17     22     24   19
4     23       15     21     25   15
5     22       18     19     23   13

In [72]:
dfZuhaireMarks.mean()   # Columnwise

Maths      21.666667
Science    16.666667
S.St.      20.666667
Hindi      24.000000
Eng        15.666667
dtype: float64

In [73]:
dfZuhaireMarks.mean(axis = 1)

3    20.4
4    19.8
5    19.0
dtype: float64

### Calculating Median

In [75]:
df.median(numeric_only = True)

UT          2.0
Maths      20.5
Science    19.5
S.St.      20.0
Hindi      22.5
Eng        21.5
dtype: float64

In [76]:
dfMaths = df["Maths"]
dfMaths

0     22
1     21
2     14
3     20
4     23
5     22
6     23
7     24
8     12
9     15
10    18
11    17
Name: Maths, dtype: int64

In [77]:
dfMathsUT1 = dfMaths[df.UT == 1]
dfMathsUT1

0    22
3    20
6    23
9    15
Name: Maths, dtype: int64

In [78]:
dfMathsUT1.median()

21.0

### Calculating Mode

DateFrame.mode() will display the mode. The mode is 
defined as the value that appears the most number of 
times in a data. This function will display the mode of 
each column or row of the DataFrame. To get the mode 
of Hindi marks, the following statement can be used.

In [80]:
df["Hindi"]

0     20
1     22
2     24
3     24
4     25
5     23
6     15
7     17
8     21
9     22
10    24
11    25
Name: Hindi, dtype: int64

In [81]:
df["Hindi"].mode()

0    24
Name: Hindi, dtype: int64

### Calculating Quartile

In [83]:
df.quantile(numeric_only = True)   # by default, median is the output

UT          2.0
Maths      20.5
Science    19.5
S.St.      20.0
Hindi      22.5
Eng        21.5
Name: 0.5, dtype: float64

In [85]:
df.quantile(q = .25, numeric_only = True)

UT          1.00
Maths      16.50
Science    18.00
S.St.      18.75
Hindi      20.75
Eng        19.75
Name: 0.25, dtype: float64

In [86]:
df.quantile(q = .75, numeric_only = True)

UT          3.00
Maths      22.25
Science    21.25
S.St.      22.50
Hindi      24.00
Eng        23.00
Name: 0.75, dtype: float64